'''
Введіть з клавіатури в масив п'ять цілочисельних значень. Виведіть їх в
один рядок через кому. Отримайте для масиву середнє арифметичне.
Васильченко Даниїл Назарович 122А
'''
import numpy as np

# Введення массиву
input_massive = np.array([int(input('Введіть елемент: ')) for i in range(5)])

# Розставимо коми за допомогою переведення у тип list та виведем середнє арифметичне
print("Елементи масиву: ", list(input_massive))
print("Середнє арифметичне елементів: ", input_massive.mean())