"""
Дані про температуру води на Чорноморському узбережжі за декаду
вересня зберігаються в масиві. Визначити, скільки за цей час було днів, придатних для
купання..
Васильченко Даниїл Назарович 122А
"""
import numpy as np
from random import randint

# Введення массиву
input_massive = np.array([randint(17, 30) for i in range(10)])

# Виведення масиву та к-ті днів можливого купання(при температурі нижче 17 не бажано)
print("Ваш масив: ", input_massive)
print("Кількість днів можливого купання: ", sum(i > 17 for i in input_massive))