"""
Дані про температуру повітря за декаду грудня зберігаються в масиві.
Визначити, скільки раз температура була вище середньої за цю декаду.
Васильченко Даниїл Назарович 122А
"""
import numpy as np
from random import randint

# Введення массиву
input_massive = np.array([randint(17, 30) for i in range(10)])

# Виведення масиву та к-ті разів коли температура була вище середньої за цю декаду(mean - середнє значення масиву)
print("Ваш масив: ", input_massive)
print("Кількість значень які вищі середнього: ", sum(i > input_massive.mean() for i in input_massive))