"""
Знайти добуток всіх елементів масиву цілих чисел, менших 0. Розмірність
масиву - 10. Заповнення масиву здійснити за допомогою клавіатури.
Васильченко Даниїл Назарович 122А
"""
import numpy as np

# Введення массиву
input_massive = np.array([int(input("Введіть елемент масиву: ")) for i in range(10)])

# Виведення масиву та добутку елементів менше 0
print("Ваш масив: ", input_massive)
kek = 1
for i in input_massive:
    if i < 0:
        kek *= i
if kek != 1:
    print("Добуток елементів : ", kek)
else:
    print("Немає елементів, що менше 0!")