"""
Знайти суму всіх елементів масиву цілих чисел що задовольняють умові:
остача від ділення на 2 дорівнює 3. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 200 до 300.
Васильченко Даниїл Назарович 122А
"""

# Перед демонстрацією рішення хочеться прокоментувати, що ділення на 2 не може дати остачу 3))))))

import numpy as np
from random import randint

# Введення массиву
input_massive = np.array([randint(200, 300) for i in range(20)])

# Виведення масиву та суми елементів остача від ділення яких на 2 дорівнює 3
print("Ваш масив: ", input_massive)
kek = 0
for i in input_massive:
    if (i % 2) == 3:
        kek += i
print("Сума елементів, остача від ділення яких на 2 дорівнює 3: ", kek)
