"""
Введіть з клавіатури п'ять цілочисельних елементів масиву X. Виведіть на
екран значення коріння і квадратів кожного з елементів масиву.
Васильченко Даниїл Назарович 122А
"""
import numpy as np
# Імпортуєм корінь із бібліотеки math
from math import sqrt


# Введення массиву
input_massive = np.array([int(input('Введіть елемент: ')) for i in range(5)])
# За допомогою функції map проводимо операції внесення під корінь та піднесення до 2 степеня всіх елементів масиву
# використовуючи тимчасову функцію lambda, для адекватного виведення перетворимо масив у список
print("Корені елементів масиву: ", list(map(lambda x: sqrt(x), input_massive)))
print("Квадрати елементів масиву: ", list(map(lambda x: x * x, input_massive)))
