"""
Напишіть програму аналізу значень температури хворого за добу:
визначте мінімальне і максимальне значення, середнє арифметичне. Заміри
температури виробляються шість раз на добу і результати вводяться з клавіатури у
масив T.
Васильченко Даниїл Назарович 122А
"""
import numpy as np

# Введення массиву
T = np.array([int(input("Значення температури: ")) for i in range(6)])
# Виведення масиву та добутку елементів
print("Ваш масив: ", T)
print(f"Мінімальна температура: {T.min()}\n"
      f"Максимальная температура: {T.max()}\n"
      f"Середня температура: {T.mean()}")