"""
Лінійний масив містить відомості про кількість опадів, що випали за
кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
Васильченко Даниїл Назарович 122А
"""
import numpy as np

# Введення массиву
T = np.array([int(input(f"Кількість опадів впродовж {i} місяця: ")) for i in range(1, 13)])
# Виведення масиву та відповідно мінімально значення масиву, кількості елементів що менше 30, середнього значення масиву
# та суму його елементів
print("Ваш масив: ", T)
print(f"Найпосушливий місяць року: {T.min()}\n"
      f"Кількість посушливих місяців: {sum(i < 30 for i in T)}\n"
      f"Середньомісячна кількість опадів: {T.mean()}\n"
      f"Загальна кількість опадів: {T.sum()}")
