"""
Обчислити середнє арифметичне значення тих елементів одновимірного
масиву, які розташовані за першим по порядку мінімальним елементом.
Васильченко Даниїл Назарович 122А
"""
import numpy as np

# Введення масиву
input_massive = list(np.array([int(input(f"Введіть число: "))
                          for i in range(int(input("Введіть довжину масиву: ")))]))
print("Ваш масив: ", input_massive)
# знаходимо мінімальне число та зріз до першого мінімального елементу з кінця
input_massive = np.array(input_massive[:input_massive.index(min(input_massive)):-1][::-1])
if len(input_massive) == 0:
    print("Мінімальний елемент - останнє число")
else:
    # Виведення масиву та середнього арифметичного масиву
    print("Ваш зрізаний масив: ", input_massive)
    print("Середнє арифметичне елементів, що знаходяться пілся першого введення мінімального значення масиву: ",
          input_massive.mean())
