"""
Змінній t привласнити значення істина, якщо в одновимірному масиві є
хоча б одне від’ємне і парне число..
Васильченко Даниїл Назарович 122А
"""
# програма створена з розумінням постановки завдання як пошук 2-х чисел, що 1 з них є парним, а інше від'ємним,
# та як пошук числа що має обидві ці характеристики
import numpy as np

# Введення масиву
input_massive = np.array([int(input(f"Введіть число: "))
                          for i in range(int(input("Введіть довжину масиву: ")))])
print("Ваш масив: ", input_massive)
# прапори позначають виконння 2-х необхідних умов
flag_1 = False
flag_2 = False
for i in input_massive:
    if i % 2 == 0:
        flag_1 = True
    if i < 0:
        flag_2 = True
    if flag_1 and flag_2:
        t = True
        print(t)
        break
else:
    print("Умови не виконані")