"""
Дані про направлення вітру (північний, південний, східний, західний) і
силі вітру за декаду листопада зберігаються в масиві. Визначити, скільки днів дув
південний вітер з силою, що перевищує 8 м / с.
Васильченко Даниїл Назарович 122А
"""
import numpy as np
from random import choice
from random import randint


wind = ["Північний ", "Південний", "Східний", "Західний"]
# Введення масиву
input_massive = np.array([[choice(wind), randint(0, 33)] for i in range(10)])
print("Ваш масив: ", input_massive)
# сума елементів більших 3 що є 2-ми елементами кожної стрічки 
print(sum(int(i[1]) > 8 for i in input_massive))