"""
Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
назву першого товару з таблиці.
Васильченко Даниїл Назарович 122А
"""
# Введення масиву
input_list = [input("Введіть товар: ")
              for i in range(int(input("Введіть кількість товарів: ")))]
print("Ваші товари ", input_list)
if input_list[0] in input_list[1:]:
    input_list.remove(input_list[0])
print("Оновлений список товарів: ", input_list)
