"""
Наведено список прізвищ брокерів товарної біржі з N чоловік. Поміняйте
місцями прізвища брокерів: першого і останнього, другого і передостаннього, третього
з початку і третього від кінця і т.д.
Васильченко Даниїл Назарович 122А
"""
import numpy as np
# Введення масиву
input_massive = np.array([input("Введіть ім'я: ") for i in range(int(input("Введіть кількість імен: ")))])
print("Список прізвищ ", input_massive)
# по факту нам просто треба перевернути масив
print("Список переміщених прізвищ: ", input_massive[::-1])