"""
Створіть масив А [1..8] за допомогою генератора випадкових чисел з
елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
елементів масиву.
Васильченко Даниїл Назарович 122А
"""
import numpy as np
from random import randint

# генерація массиву
input_massive = np.array([randint(-10, 10) for i in range(8)])

# виведемо масив з усіма елементами та к-ть елементів менше 0
print("Ваш масив: ", input_massive)
print("К-ть елементів що менше 0: ", sum(i < 0 for i in input_massive))
