"""
Створіть масив А [1..12] за допомогою генератора випадкових чисел з
елементами від -20 до 10 і виведіть його на екран. Замініть всі від’ємні елементи
масиву числом 0.
Васильченко Даниїл Назарович 122А
"""
import numpy as np
from random import randint


# ф-я перевірки на знак перед числом
def zero(x):
    if x < 0:
        return 0
    else:
        return x


# генерація массиву
input_massive = np.array([randint(-20, 10) for i in range(12)])

# виведемо масив з усіма елементами, потім проведемо заміну на 0 від'мних елементів(за допомогою ф-ї zero)
# і виведем оновлений масив перетворивший його на список
print("Ваш масив: ", input_massive)
print("Ваш масив із заміною від'ємних елементів на 0: ", list(map(zero, input_massive)))
