"""
Створіть цілочисельний масив А [1..15] за допомогою генератора
випадкових чисел з елементами від -15 до 30 і виведіть його на екран. Визначте
найбільший елемент масиву і його індекс.
Васильченко Даниїл Назарович 122А
"""
import numpy as np
from random import randint

# генерація массиву
input_massive = np.array([randint(-15, 30) for i in range(12)])

# виведемо масив з усіма елементами, потім знаходимо найбільший елемент, знаходимо його індекс методом index()
print("Ваш масив: ", input_massive)
max_num = input_massive.max()
print("Максимальний елемент масиву та його індекс: ", max_num, "[", list(input_massive).index(max_num), "]")
